fernandezgonzalo/dose2014/trunk/implementations/group6/Win64-RC/C7/ht323.c
/*
 * Code for class HTTP_DATE
 */

#include "eif_eiffel.h"
#include "../E1/estructure.h"
#include "../E1/eoffsets.h"

#include "ht323.h"
#include <ctype.h>
#include "eif_out.h"

#ifdef __cplusplus
extern "C" {
#endif


#ifdef __cplusplus
}
#endif


#ifdef __cplusplus
extern "C" {
#endif

/* {HTTP_DATE}.make_from_timestamp */
void F748_6126 (EIF_REFERENCE Current, EIF_INTEGER_64 arg1)
{
	GTCX
	EIF_REFERENCE tr1 = NULL;
	EIF_INTEGER_32 ti4_1;
	RTLD;
	
	RTLI(2);
	RTLR(0,Current);
	RTLR(1,tr1);
	
	RTGC;
	*(EIF_INTEGER_64 *)(Current+ _I64OFF_2_1_0_0_0_0_0_) = (EIF_INTEGER_64) arg1;
	tr1 = RTLNSMART(eif_non_attached_type(937));
	ti4_1 = (EIF_INTEGER_32) arg1;
	F938_8183(RTCV(tr1), ti4_1);
	RTAR(Current, tr1);
	*(EIF_REFERENCE *)(Current) = (EIF_REFERENCE) tr1;
	RTLE;
}

/* {HTTP_DATE}.make_from_string */
void F748_6127 (EIF_REFERENCE Current, EIF_REFERENCE arg1)
{
	GTCX
	EIF_REFERENCE loc1 = (EIF_REFERENCE) 0;
	EIF_REFERENCE loc2 = (EIF_REFERENCE) 0;
	EIF_REFERENCE tr1 = NULL;
	RTLD;
	
	RTLI(5);
	RTLR(0,loc1);
	RTLR(1,arg1);
	RTLR(2,Current);
	RTLR(3,tr1);
	RTLR(4,loc2);
	
	RTGC;
	tr1 = F748_6156(Current, arg1);
	loc1 = tr1;
	if (EIF_TEST(loc1)) {
		RTAR(Current, loc1);
		*(EIF_REFERENCE *)(Current) = (EIF_REFERENCE) loc1;
	} else {
		tr1 = F748_6157(Current, arg1);
		loc2 = tr1;
		if (EIF_TEST(loc2)) {
			RTAR(Current, loc2);
			*(EIF_REFERENCE *)(Current) = (EIF_REFERENCE) loc2;
		} else {
			*(EIF_BOOLEAN *)(Current+ _CHROFF_2_0_) = (EIF_BOOLEAN) (EIF_BOOLEAN) 1;
			tr1 = RTOSCF(6134,F748_6134,(Current));
			RTAR(Current, tr1);
			*(EIF_REFERENCE *)(Current) = (EIF_REFERENCE) tr1;
		}
	}
	RTLE;
}

/* {HTTP_DATE}.make_from_date_time */
void F748_6128 (EIF_REFERENCE Current, EIF_REFERENCE arg1)
{
	GTCX
	
	
	RTAR(Current, arg1);
	*(EIF_REFERENCE *)(Current) = (EIF_REFERENCE) arg1;
}

/* {HTTP_DATE}.date_time */
EIF_REFERENCE F748_6131 (EIF_REFERENCE Current)
{
	return *(EIF_REFERENCE *)(Current);
}


/* {HTTP_DATE}.string */
EIF_REFERENCE F748_6132 (EIF_REFERENCE Current)
{
	GTCX
	
	
	return (EIF_REFERENCE) F748_6138(Current);
}

/* {HTTP_DATE}.epoch */
static EIF_REFERENCE F748_6134_body (EIF_REFERENCE Current)
{
	GTCX
	RTEX;
	EIF_REFERENCE tr1 = NULL;
	RTLD;
	

	RTLI(1);
	RTLR(0,tr1);
	
	RTEV;
	RTGC;
	RTOSP (6134);
#define Result RTOSR(6134)
	RTOC_NEW(Result);
	tr1 = RTLNS(937, 937, _OBJSIZ_2_0_0_2_0_0_0_1_);
	F938_8183(RTCV(tr1), ((EIF_INTEGER_32) 0L));
	Result = (EIF_REFERENCE) tr1;
	RTOSE (6134);
	RTLE;
	RTEE;
	return Result;
#undef Result
}

EIF_REFERENCE F748_6134 (EIF_REFERENCE Current)
{
	GTCX
	return RTOSCF(6134,F748_6134_body,(Current));
}

/* {HTTP_DATE}.internal_rfc1123_string */
EIF_REFERENCE F748_6136 (EIF_REFERENCE Current)
{
	return *(EIF_REFERENCE *)(Current + _REFACS_1_);
}


/* {HTTP_DATE}.rfc1123_string */
EIF_REFERENCE F748_6138 (EIF_REFERENCE Current)
{
	GTCX
	EIF_REFERENCE loc1 = (EIF_REFERENCE) 0;
	EIF_REFERENCE tr1 = NULL;
	RTLD;
	
	RTLI(3);
	RTLR(0,loc1);
	RTLR(1,Current);
	RTLR(2,tr1);
	
	RTGC;
	loc1 = *(EIF_REFERENCE *)(Current + _REFACS_1_);
	if ((EIF_BOOLEAN)(loc1 == NULL)) {
		tr1 = RTLNSMART(eif_non_attached_type(740));
		F737_5723(RTCV(tr1), ((EIF_INTEGER_32) 32L));
		loc1 = (EIF_REFERENCE) tr1;
		tr1 = *(EIF_REFERENCE *)(Current);
		F748_6146(Current, tr1, loc1);
		RTAR(Current, loc1);
		*(EIF_REFERENCE *)(Current + _REFACS_1_) = (EIF_REFERENCE) loc1;
	}
	RTLE;
	return (EIF_REFERENCE) loc1;
}

/* {HTTP_DATE}.append_to_rfc1123_string */
void F748_6142 (EIF_REFERENCE Current, EIF_REFERENCE arg1)
{
	GTCX
	EIF_REFERENCE loc1 = (EIF_REFERENCE) 0;
	EIF_REFERENCE tr1 = NULL;
	EIF_INTEGER_32 ti4_1;
	EIF_NATURAL_32 tu4_1;
	RTLD;
	
	RTLI(4);
	RTLR(0,loc1);
	RTLR(1,Current);
	RTLR(2,tr1);
	RTLR(3,arg1);
	
	RTGC;
	loc1 = *(EIF_REFERENCE *)(Current);
	tr1 = *(EIF_REFERENCE *)(RTCV(loc1) + _REFACS_1_);
	ti4_1 = F933_8086(RTCV(tr1));
	F748_6152(Current, ti4_1, arg1);
	tu4_1 = (EIF_NATURAL_32) ((EIF_INTEGER_32) 44L);
	F739_5795(RTCV(arg1), tu4_1);
	tu4_1 = (EIF_NATURAL_32) ((EIF_INTEGER_32) 32L);
	F739_5795(RTCV(arg1), tu4_1);
	ti4_1 = F123_1621(RTCV(loc1));
	F748_6150(Current, ti4_1, arg1);
	tu4_1 = (EIF_NATURAL_32) ((EIF_INTEGER_32) 32L);
	F739_5795(RTCV(arg1), tu4_1);
	ti4_1 = F123_1620(RTCV(loc1));
	F748_6154(Current, ti4_1, arg1);
	tu4_1 = (EIF_NATURAL_32) ((EIF_INTEGER_32) 32L);
	F739_5795(RTCV(arg1), tu4_1);
	ti4_1 = F123_1619(RTCV(loc1));
	F748_6155(Current, ti4_1, arg1);
	tu4_1 = (EIF_NATURAL_32) ((EIF_INTEGER_32) 32L);
	F739_5795(RTCV(arg1), tu4_1);
	tr1 = *(EIF_REFERENCE *)(RTCV(loc1));
	F748_6151(Current, tr1, arg1);
	tr1 = RTMS_EX_H(" GMT",4,541543764);
	(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg1)-738])(RTCV(arg1), tr1);
	RTLE;
}

/* {HTTP_DATE}.append_date_time_to_rfc1123_string */
void F748_6146 (EIF_REFERENCE Current, EIF_REFERENCE arg1, EIF_REFERENCE arg2)
{
	GTCX
	EIF_REFERENCE tr1 = NULL;
	EIF_INTEGER_32 ti4_1;
	EIF_NATURAL_32 tu4_1;
	RTLD;
	
	RTLI(4);
	RTLR(0,arg1);
	RTLR(1,tr1);
	RTLR(2,arg2);
	RTLR(3,Current);
	
	RTGC;
	tr1 = *(EIF_REFERENCE *)(RTCV(arg1) + _REFACS_1_);
	ti4_1 = F933_8086(RTCV(tr1));
	F748_6152(Current, ti4_1, arg2);
	tu4_1 = (EIF_NATURAL_32) ((EIF_INTEGER_32) 44L);
	F739_5795(RTCV(arg2), tu4_1);
	tu4_1 = (EIF_NATURAL_32) ((EIF_INTEGER_32) 32L);
	F739_5795(RTCV(arg2), tu4_1);
	ti4_1 = F123_1621(RTCV(arg1));
	F748_6150(Current, ti4_1, arg2);
	tu4_1 = (EIF_NATURAL_32) ((EIF_INTEGER_32) 32L);
	F739_5795(RTCV(arg2), tu4_1);
	ti4_1 = F123_1620(RTCV(arg1));
	F748_6154(Current, ti4_1, arg2);
	tu4_1 = (EIF_NATURAL_32) ((EIF_INTEGER_32) 32L);
	F739_5795(RTCV(arg2), tu4_1);
	ti4_1 = F123_1619(RTCV(arg1));
	F748_6155(Current, ti4_1, arg2);
	tu4_1 = (EIF_NATURAL_32) ((EIF_INTEGER_32) 32L);
	F739_5795(RTCV(arg2), tu4_1);
	tr1 = *(EIF_REFERENCE *)(RTCV(arg1));
	F748_6151(Current, tr1, arg2);
	tr1 = RTMS_EX_H(" GMT",4,541543764);
	(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
	RTLE;
}

/* {HTTP_DATE}.append_2_digits_integer_to */
void F748_6150 (EIF_REFERENCE Current, EIF_INTEGER_32 arg1, EIF_REFERENCE arg2)
{
	GTCX
	EIF_NATURAL_32 tu4_1;
	RTLD;
	
	RTLI(2);
	RTLR(0,arg2);
	RTLR(1,Current);
	
