fernandezgonzalo/dose2014/trunk/implementations/group6/Win64-RC/C7/ht323.c
	RTGC;
	if ((EIF_BOOLEAN) (arg1 <= ((EIF_INTEGER_32) 9L))) {
		tu4_1 = (EIF_NATURAL_32) ((EIF_INTEGER_32) 48L);
		F739_5795(RTCV(arg2), tu4_1);
	}
	F748_6155(Current, arg1, arg2);
	RTLE;
}

/* {HTTP_DATE}.append_2_digits_time_to */
void F748_6151 (EIF_REFERENCE Current, EIF_REFERENCE arg1, EIF_REFERENCE arg2)
{
	GTCX
	EIF_INTEGER_32 ti4_1;
	EIF_NATURAL_32 tu4_1;
	RTLD;
	
	RTLI(3);
	RTLR(0,arg1);
	RTLR(1,arg2);
	RTLR(2,Current);
	
	RTGC;
	ti4_1 = F121_1584(RTCV(arg1));
	F748_6150(Current, ti4_1, arg2);
	tu4_1 = (EIF_NATURAL_32) ((EIF_INTEGER_32) 58L);
	F739_5795(RTCV(arg2), tu4_1);
	ti4_1 = F121_1585(RTCV(arg1));
	F748_6150(Current, ti4_1, arg2);
	tu4_1 = (EIF_NATURAL_32) ((EIF_INTEGER_32) 58L);
	F739_5795(RTCV(arg2), tu4_1);
	ti4_1 = F121_1586(RTCV(arg1));
	F748_6150(Current, ti4_1, arg2);
	RTLE;
}

/* {HTTP_DATE}.append_day_ddd_to */
void F748_6152 (EIF_REFERENCE Current, EIF_INTEGER_32 arg1, EIF_REFERENCE arg2)
{
	GTCX
	EIF_REFERENCE tr1 = NULL;
	RTLD;
	
	RTLI(2);
	RTLR(0,arg2);
	RTLR(1,tr1);
	
	RTGC;
	switch (arg1) {
		case 1L:
			tr1 = RTMS_EX_H("Sun",3,5469550);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 2L:
			tr1 = RTMS_EX_H("Mon",3,5074798);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 3L:
			tr1 = RTMS_EX_H("Tue",3,5535077);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 4L:
			tr1 = RTMS_EX_H("Wed",3,5727588);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 5L:
			tr1 = RTMS_EX_H("Thu",3,5531765);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 6L:
			tr1 = RTMS_EX_H("Fri",3,4616809);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 7L:
			tr1 = RTMS_EX_H("Sat",3,5464436);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
	}
	RTLE;
}

/* {HTTP_DATE}.append_month_mmm_to */
void F748_6154 (EIF_REFERENCE Current, EIF_INTEGER_32 arg1, EIF_REFERENCE arg2)
{
	GTCX
	EIF_REFERENCE tr1 = NULL;
	RTLD;
	
	RTLI(2);
	RTLR(0,arg2);
	RTLR(1,tr1);
	
	RTGC;
	switch (arg1) {
		case 1L:
			tr1 = RTMS_EX_H("Jan",3,4874606);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 2L:
			tr1 = RTMS_EX_H("Feb",3,4613474);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 3L:
			tr1 = RTMS_EX_H("Mar",3,5071218);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 4L:
			tr1 = RTMS_EX_H("Apr",3,4288626);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 5L:
			tr1 = RTMS_EX_H("May",3,5071225);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 6L:
			tr1 = RTMS_EX_H("Jun",3,4879726);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 7L:
			tr1 = RTMS_EX_H("Jul",3,4879724);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 8L:
			tr1 = RTMS_EX_H("Aou",3,4288373);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 9L:
			tr1 = RTMS_EX_H("Sep",3,5465456);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 10L:
			tr1 = RTMS_EX_H("Oct",3,5202804);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 11L:
			tr1 = RTMS_EX_H("Nov",3,5140342);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
		case 12L:
			tr1 = RTMS_EX_H("Dec",3,4482403);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
			break;
	}
	RTLE;
}

/* {HTTP_DATE}.append_integer_to */
void F748_6155 (EIF_REFERENCE Current, EIF_INTEGER_32 arg1, EIF_REFERENCE arg2)
{
	GTCX
	EIF_REFERENCE loc1 = (EIF_REFERENCE) 0;
	EIF_REFERENCE loc2 = (EIF_REFERENCE) 0;
	EIF_REFERENCE tr1 = NULL;
	RTLD;
	
	RTLI(4);
	RTLR(0,loc1);
	RTLR(1,arg2);
	RTLR(2,loc2);
	RTLR(3,tr1);
	
	RTGC;
	loc1 = arg2;
	loc1 = RTRV(eif_non_attached_type(739),loc1);
	if (EIF_TEST(loc1)) {
		F740_5851(RTCV(loc1), arg1);
	} else {
		loc2 = arg2;
		loc2 = RTRV(eif_non_attached_type(740),loc2);
		if (EIF_TEST(loc2)) {
			F741_5942(RTCV(loc2), arg1);
		} else {
			tr1 = c_outi(arg1);
			(FUNCTION_CAST(void, (EIF_REFERENCE, EIF_REFERENCE)) R4747[Dtype(arg2)-738])(RTCV(arg2), tr1);
		}
	}
	RTLE;
}

/* {HTTP_DATE}.string_to_date_time */
EIF_REFERENCE F748_6156 (EIF_REFERENCE Current, EIF_REFERENCE arg1)
{
	GTCX
	EIF_REFERENCE loc1 = (EIF_REFERENCE) 0;
	EIF_REFERENCE loc2 = (EIF_REFERENCE) 0;
	EIF_REFERENCE loc3 = (EIF_REFERENCE) 0;
	EIF_INTEGER_32 loc4 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc5 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc6 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc7 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc8 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc9 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc10 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc11 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc12 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc13 = (EIF_INTEGER_32) 0;
	EIF_BOOLEAN loc14 = (EIF_BOOLEAN) 0;
	EIF_REFERENCE tr1 = NULL;
	EIF_INTEGER_32 ti4_1;
	EIF_INTEGER_32 ti4_2;
	EIF_BOOLEAN tb1;
	EIF_BOOLEAN tb2;
	EIF_BOOLEAN tb3;
	EIF_BOOLEAN tb4;
	EIF_BOOLEAN tb5;
	EIF_BOOLEAN tb6;
	EIF_BOOLEAN tb7;
	EIF_BOOLEAN tb8;
	EIF_BOOLEAN tb9;
	EIF_BOOLEAN tb10;
	EIF_BOOLEAN tb11;
	EIF_BOOLEAN tb12;
	EIF_BOOLEAN tb13;
	EIF_BOOLEAN tb14;
	EIF_BOOLEAN tb15;
	EIF_BOOLEAN tb16;
	EIF_BOOLEAN tb17;
	EIF_BOOLEAN tb18;
	EIF_BOOLEAN tb19;
	EIF_BOOLEAN tb20;
	EIF_BOOLEAN tb21;
	EIF_CHARACTER_8 tc1;
	EIF_REFERENCE Result = ((EIF_REFERENCE) 0);
	
	RTLD;
	
	RTLI(6);
	RTLR(0,arg1);
	RTLR(1,loc1);
	RTLR(2,tr1);
	RTLR(3,loc2);
	RTLR(4,loc3);
	RTLR(5,Result);
	
