fernandezgonzalo/dose2014/trunk/implementations/group6/Win64-RC/C7/ht323.c
/* {HTTP_DATE}.ansi_c_string_to_date_time */
EIF_REFERENCE F748_6157 (EIF_REFERENCE Current, EIF_REFERENCE arg1)
{
	GTCX
	EIF_REFERENCE loc1 = (EIF_REFERENCE) 0;
	EIF_REFERENCE loc2 = (EIF_REFERENCE) 0;
	EIF_REFERENCE loc3 = (EIF_REFERENCE) 0;
	EIF_INTEGER_32 loc4 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc5 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc6 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc7 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc8 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc9 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc10 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc11 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc12 = (EIF_INTEGER_32) 0;
	EIF_INTEGER_32 loc13 = (EIF_INTEGER_32) 0;
	EIF_BOOLEAN loc14 = (EIF_BOOLEAN) 0;
	EIF_REFERENCE tr1 = NULL;
	EIF_INTEGER_32 ti4_1;
	EIF_INTEGER_32 ti4_2;
	EIF_BOOLEAN tb1;
	EIF_BOOLEAN tb2;
	EIF_BOOLEAN tb3;
	EIF_BOOLEAN tb4;
	EIF_BOOLEAN tb5;
	EIF_BOOLEAN tb6;
	EIF_BOOLEAN tb7;
	EIF_BOOLEAN tb8;
	EIF_BOOLEAN tb9;
	EIF_BOOLEAN tb10;
	EIF_BOOLEAN tb11;
	EIF_BOOLEAN tb12;
	EIF_BOOLEAN tb13;
	EIF_BOOLEAN tb14;
	EIF_BOOLEAN tb15;
	EIF_BOOLEAN tb16;
	EIF_BOOLEAN tb17;
	EIF_BOOLEAN tb18;
	EIF_BOOLEAN tb19;
	EIF_BOOLEAN tb20;
	EIF_BOOLEAN tb21;
	EIF_CHARACTER_8 tc1;
	EIF_REFERENCE Result = ((EIF_REFERENCE) 0);
	
	RTLD;
	
	RTLI(6);
	RTLR(0,arg1);
	RTLR(1,loc1);
	RTLR(2,tr1);
	RTLR(3,loc2);
	RTLR(4,loc3);
	RTLR(5,Result);
	
	RTGC;
	loc12 = (EIF_INTEGER_32) ((EIF_INTEGER_32) 1L);
	loc13 = *(EIF_INTEGER_32 *)(RTCV(arg1) + O4737[Dtype(arg1)-736]);
	tr1 = RTLNS(740, 740, _OBJSIZ_1_1_0_3_0_0_0_0_);
	F737_5723(RTCV(tr1), ((EIF_INTEGER_32) 4L));
	loc1 = (EIF_REFERENCE) tr1;
	for (;;) {
		tb1 = '\01';
		if (!(EIF_BOOLEAN) (loc12 > loc13)) {
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			tb2 = EIF_TEST(isspace(tc1));
			tb1 = (EIF_BOOLEAN) !tb2;
		}
		if (tb1) break;
		loc12++;
	}
	F741_5966(RTCV(loc1));
	for (;;) {
		tb2 = '\01';
		if (!(EIF_BOOLEAN) (loc12 > loc13)) {
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			tr1 = RTLNS(690, 690, _OBJSIZ_0_1_0_0_0_0_0_0_);
			*(EIF_CHARACTER_8 *)tr1 = tc1;
			
			tb3 = F689_5425(RTCV(tr1));
			tb2 = (EIF_BOOLEAN) !tb3;
		}
		if (tb2) break;
		tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
		F741_5953(RTCV(loc1), tc1);
		loc12++;
	}
	tb3 = '\0';
	if ((EIF_BOOLEAN) (loc12 <= loc13)) {
		ti4_1 = *(EIF_INTEGER_32 *)(RTCV(loc1)+ _LNGOFF_1_1_0_2_);
		tb3 = (EIF_BOOLEAN) (ti4_1 >= ((EIF_INTEGER_32) 3L));
	}
	if (tb3) {
		loc2 = F741_5972(RTCV(loc1));
	} else {
		loc14 = (EIF_BOOLEAN) (EIF_BOOLEAN) 1;
	}
	for (;;) {
		tb3 = '\01';
		if (!(EIF_BOOLEAN) (loc12 > loc13)) {
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			tb4 = EIF_TEST(isspace(tc1));
			tb3 = (EIF_BOOLEAN) !tb4;
		}
		if (tb3) break;
		loc12++;
	}
	if ((EIF_BOOLEAN) !loc14) {
		F741_5966(RTCV(loc1));
		for (;;) {
			tb4 = '\01';
			if (!(EIF_BOOLEAN) (loc12 > loc13)) {
				tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
				tr1 = RTLNS(690, 690, _OBJSIZ_0_1_0_0_0_0_0_0_);
				*(EIF_CHARACTER_8 *)tr1 = tc1;
				
				tb5 = F689_5425(RTCV(tr1));
				tb4 = (EIF_BOOLEAN) !tb5;
			}
			if (tb4) break;
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			F741_5953(RTCV(loc1), tc1);
			loc12++;
		}
		tb5 = '\0';
		if ((EIF_BOOLEAN) (loc12 <= loc13)) {
			ti4_1 = *(EIF_INTEGER_32 *)(RTCV(loc1)+ _LNGOFF_1_1_0_2_);
			tb5 = (EIF_BOOLEAN) (ti4_1 >= ((EIF_INTEGER_32) 3L));
		}
		if (tb5) {
			loc3 = F741_5973(RTCV(loc1));
			ti4_1 = *(EIF_INTEGER_32 *)(RTCV(loc3)+ _LNGOFF_1_1_0_2_);
			if ((EIF_BOOLEAN) (ti4_1 > ((EIF_INTEGER_32) 3L))) {
				F741_5920(RTCV(loc3), ((EIF_INTEGER_32) 3L));
			}
			tr1 = RTMS_EX_H("JAN",3,4866382);
			tb5 = F737_5748(RTCV(loc3), tr1);
			if (tb5) {
				loc10 = (EIF_INTEGER_32) ((EIF_INTEGER_32) 1L);
			} else {
				tr1 = RTMS_EX_H("FEB",3,4605250);
				tb5 = F737_5748(RTCV(loc3), tr1);
				if (tb5) {
					loc10 = (EIF_INTEGER_32) ((EIF_INTEGER_32) 2L);
				} else {
					tr1 = RTMS_EX_H("MAR",3,5062994);
					tb5 = F737_5748(RTCV(loc3), tr1);
					if (tb5) {
						loc10 = (EIF_INTEGER_32) ((EIF_INTEGER_32) 3L);
					} else {
						tr1 = RTMS_EX_H("APR",3,4280402);
						tb5 = F737_5748(RTCV(loc3), tr1);
						if (tb5) {
							loc10 = (EIF_INTEGER_32) ((EIF_INTEGER_32) 4L);
						} else {
							tr1 = RTMS_EX_H("MAY",3,5063001);
							tb5 = F737_5748(RTCV(loc3), tr1);
							if (tb5) {
								loc10 = (EIF_INTEGER_32) ((EIF_INTEGER_32) 5L);
							} else {
								tr1 = RTMS_EX_H("JUN",3,4871502);
								tb5 = F737_5748(RTCV(loc3), tr1);
								if (tb5) {
									loc10 = (EIF_INTEGER_32) ((EIF_INTEGER_32) 6L);
								} else {
									tr1 = RTMS_EX_H("JUL",3,4871500);
									tb5 = F737_5748(RTCV(loc3), tr1);
									if (tb5) {
										loc10 = (EIF_INTEGER_32) ((EIF_INTEGER_32) 7L);
									} else {
										tr1 = RTMS_EX_H("AOU",3,4280149);
										tb5 = F737_5748(RTCV(loc3), tr1);
										if (tb5) {
											loc10 = (EIF_INTEGER_32) ((EIF_INTEGER_32) 8L);
										} else {
											tr1 = RTMS_EX_H("SEP",3,5457232);
											tb5 = F737_5748(RTCV(loc3), tr1);
											if (tb5) {
												loc10 = (EIF_INTEGER_32) ((EIF_INTEGER_32) 9L);
											} else {
												tr1 = RTMS_EX_H("OCT",3,5194580);
												tb5 = F737_5748(RTCV(loc3), tr1);
												if (tb5) {
													loc10 = (EIF_INTEGER_32) ((EIF_INTEGER_32) 10L);
												} else {
													tr1 = RTMS_EX_H("NOV",3,5132118);
													tb5 = F737_5748(RTCV(loc3), tr1);
													if (tb5) {
														loc10 = (EIF_INTEGER_32) ((EIF_INTEGER_32) 11L);
													} else {
														tr1 = RTMS_EX_H("DEC",3,4474179);
														tb5 = F737_5748(RTCV(loc3), tr1);
														if (tb5) {
															loc10 = (EIF_INTEGER_32) ((EIF_INTEGER_32) 12L);
														} else {
															loc14 = (EIF_BOOLEAN) (EIF_BOOLEAN) 1;
														}
													}
												}
											}
										}
									}
								}
							}
						}
					}
				}
			}
		} else {
			loc14 = (EIF_BOOLEAN) (EIF_BOOLEAN) 1;
		}
	}
	for (;;) {
		tb5 = '\01';
		if (!(EIF_BOOLEAN) (loc12 > loc13)) {
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			tb6 = EIF_TEST(isspace(tc1));
			tb5 = (EIF_BOOLEAN) !tb6;
		}
		if (tb5) break;
		loc12++;
	}
	if ((EIF_BOOLEAN) ((EIF_BOOLEAN) !loc14 && (EIF_BOOLEAN) (loc12 <= loc13))) {
		F741_5966(RTCV(loc1));
		for (;;) {
			tb6 = '\01';
			if (!(EIF_BOOLEAN) (loc12 > loc13)) {
				tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
				tb7 = EIF_TEST(isdigit(tc1));
				tb6 = (EIF_BOOLEAN) !tb7;
			}
			if (tb6) break;
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			F741_5953(RTCV(loc1), tc1);
			loc12++;
		}
		tb7 = '\0';
		if ((EIF_BOOLEAN) (loc12 <= loc13)) {
			ti4_1 = *(EIF_INTEGER_32 *)(RTCV(loc1)+ _LNGOFF_1_1_0_2_);
			tb7 = (EIF_BOOLEAN) (ti4_1 > ((EIF_INTEGER_32) 0L));
		}
		if (tb7) {
			loc4 = F733_5619(RTCV(loc1));
		} else {
			loc14 = (EIF_BOOLEAN) (EIF_BOOLEAN) 1;
		}
	} else {
		loc14 = (EIF_BOOLEAN) (EIF_BOOLEAN) 1;
	}
	for (;;) {
		tb7 = '\01';
		if (!(EIF_BOOLEAN) (loc12 > loc13)) {
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			tb8 = EIF_TEST(isspace(tc1));
			tb7 = (EIF_BOOLEAN) !tb8;
		}
		if (tb7) break;
		loc12++;
	}
	if ((EIF_BOOLEAN) !loc14) {
		F741_5966(RTCV(loc1));
		for (;;) {
			tb8 = '\01';
			if (!(EIF_BOOLEAN) (loc12 > loc13)) {
				tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
				tb9 = EIF_TEST(isdigit(tc1));
				tb8 = (EIF_BOOLEAN) !tb9;
			}
			if (tb8) break;
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			F741_5953(RTCV(loc1), tc1);
			loc12++;
		}
		tb9 = '\0';
		tb10 = '\0';
		if ((EIF_BOOLEAN) (loc12 <= loc13)) {
			ti4_1 = *(EIF_INTEGER_32 *)(RTCV(loc1)+ _LNGOFF_1_1_0_2_);
			tb10 = (EIF_BOOLEAN) (ti4_1 > ((EIF_INTEGER_32) 0L));
		}
		if (tb10) {
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			tb9 = (EIF_BOOLEAN)(tc1 == (EIF_CHARACTER_8) ':');
		}
		if (tb9) {
			loc6 = F733_5619(RTCV(loc1));
			loc12++;
		} else {
			loc14 = (EIF_BOOLEAN) (EIF_BOOLEAN) 1;
		}
	}
	if ((EIF_BOOLEAN) !loc14) {
		F741_5966(RTCV(loc1));
		for (;;) {
			tb9 = '\01';
			if (!(EIF_BOOLEAN) (loc12 > loc13)) {
				tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
				tb10 = EIF_TEST(isdigit(tc1));
				tb9 = (EIF_BOOLEAN) !tb10;
			}
			if (tb9) break;
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			F741_5953(RTCV(loc1), tc1);
			loc12++;
		}
		tb10 = '\0';
		tb11 = '\0';
		if ((EIF_BOOLEAN) (loc12 <= loc13)) {
			ti4_1 = *(EIF_INTEGER_32 *)(RTCV(loc1)+ _LNGOFF_1_1_0_2_);
			tb11 = (EIF_BOOLEAN) (ti4_1 > ((EIF_INTEGER_32) 0L));
		}
		if (tb11) {
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			tb10 = (EIF_BOOLEAN)(tc1 == (EIF_CHARACTER_8) ':');
		}
		if (tb10) {
			loc7 = F733_5619(RTCV(loc1));
			loc12++;
		} else {
			loc14 = (EIF_BOOLEAN) (EIF_BOOLEAN) 1;
		}
	}
	if ((EIF_BOOLEAN) !loc14) {
		F741_5966(RTCV(loc1));
		for (;;) {
			tb10 = '\01';
			if (!(EIF_BOOLEAN) (loc12 > loc13)) {
				tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
				tb11 = EIF_TEST(isdigit(tc1));
				tb10 = (EIF_BOOLEAN) !tb11;
			}
			if (tb10) break;
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			F741_5953(RTCV(loc1), tc1);
			loc12++;
		}
		tb11 = '\0';
		if ((EIF_BOOLEAN) (loc12 <= loc13)) {
			ti4_1 = *(EIF_INTEGER_32 *)(RTCV(loc1)+ _LNGOFF_1_1_0_2_);
			tb11 = (EIF_BOOLEAN) (ti4_1 > ((EIF_INTEGER_32) 0L));
		}
		if (tb11) {
			loc8 = F733_5619(RTCV(loc1));
		} else {
			loc14 = (EIF_BOOLEAN) (EIF_BOOLEAN) 1;
		}
	}
	tb11 = '\0';
	if ((EIF_BOOLEAN) !loc14) {
		tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
		tb11 = (EIF_BOOLEAN)(tc1 == (EIF_CHARACTER_8) '.');
	}
	if (tb11) {
		loc12++;
		F741_5966(RTCV(loc1));
		for (;;) {
			tb11 = '\01';
			if (!(EIF_BOOLEAN) (loc12 > loc13)) {
				tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
				tb12 = EIF_TEST(isdigit(tc1));
				tb11 = (EIF_BOOLEAN) !tb12;
			}
			if (tb11) break;
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			F741_5953(RTCV(loc1), tc1);
			loc12++;
		}
		tb12 = '\0';
		if ((EIF_BOOLEAN) (loc12 <= loc13)) {
			ti4_1 = *(EIF_INTEGER_32 *)(RTCV(loc1)+ _LNGOFF_1_1_0_2_);
			tb12 = (EIF_BOOLEAN) (ti4_1 > ((EIF_INTEGER_32) 0L));
		}
		if (tb12) {
			loc9 = F733_5619(RTCV(loc1));
		} else {
			loc14 = (EIF_BOOLEAN) (EIF_BOOLEAN) 1;
		}
	}
	for (;;) {
		tb12 = '\01';
		if (!(EIF_BOOLEAN) (loc12 > loc13)) {
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			tb13 = EIF_TEST(isspace(tc1));
			tb12 = (EIF_BOOLEAN) !tb13;
		}
		if (tb12) break;
		loc12++;
	}
	if ((EIF_BOOLEAN) !loc14) {
		F741_5966(RTCV(loc1));
		for (;;) {
			tb13 = '\01';
			if (!(EIF_BOOLEAN) (loc12 > loc13)) {
				tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
				tb14 = EIF_TEST(isdigit(tc1));
				tb13 = (EIF_BOOLEAN) !tb14;
			}
			if (tb13) break;
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			F741_5953(RTCV(loc1), tc1);
			loc12++;
		}
		ti4_1 = *(EIF_INTEGER_32 *)(RTCV(loc1)+ _LNGOFF_1_1_0_2_);
		if ((EIF_BOOLEAN) (ti4_1 > ((EIF_INTEGER_32) 0L))) {
			loc5 = F733_5619(RTCV(loc1));
			ti4_1 = *(EIF_INTEGER_32 *)(RTCV(loc1)+ _LNGOFF_1_1_0_2_);
			if ((EIF_BOOLEAN)(ti4_1 == ((EIF_INTEGER_32) 2L))) {
				loc5 += ((EIF_INTEGER_32) 1900L);
			}
		} else {
			loc14 = (EIF_BOOLEAN) (EIF_BOOLEAN) 1;
		}
	}
	for (;;) {
		tb14 = '\01';
		if (!(EIF_BOOLEAN) (loc12 > loc13)) {
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			tb15 = EIF_TEST(isspace(tc1));
			tb14 = (EIF_BOOLEAN) !tb15;
		}
		if (tb14) break;
		loc12++;
	}
	if ((EIF_BOOLEAN) ((EIF_BOOLEAN) (loc12 <= loc13) && (EIF_BOOLEAN) !loc14)) {
		for (;;) {
			tb15 = '\01';
			if (!(EIF_BOOLEAN) (loc12 > loc13)) {
				tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
				tb16 = EIF_TEST(isspace(tc1));
				tb15 = (EIF_BOOLEAN) !tb16;
			}
			if (tb15) break;
			loc12++;
		}
		F741_5966(RTCV(loc1));
		for (;;) {
			tb16 = '\01';
			if (!(EIF_BOOLEAN) (loc12 > loc13)) {
				tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
				tr1 = RTLNS(690, 690, _OBJSIZ_0_1_0_0_0_0_0_0_);
				*(EIF_CHARACTER_8 *)tr1 = tc1;
				
				tb17 = F689_5425(RTCV(tr1));
				tb16 = (EIF_BOOLEAN) !tb17;
			}
			if (tb16) break;
			tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
			tc1 = (EIF_CHARACTER_8) toupper(tc1);
			F741_5953(RTCV(loc1), tc1);
			loc12++;
		}
		tb17 = '\01';
		tr1 = RTMS_EX_H("GMT",3,4672852);
		tb18 = F737_5748(RTCV(loc1), tr1);
		if (!tb18) {
			tr1 = RTMS_EX_H("UTC",3,5592131);
			tb18 = F737_5748(RTCV(loc1), tr1);
			tb17 = tb18;
		}
		if (tb17) {
			for (;;) {
				tb17 = '\01';
				if (!(EIF_BOOLEAN) (loc12 > loc13)) {
					tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
					tb18 = EIF_TEST(isspace(tc1));
					tb17 = (EIF_BOOLEAN) !tb18;
				}
				if (tb17) break;
				loc12++;
			}
			if ((EIF_BOOLEAN) (loc12 <= loc13)) {
				F741_5966(RTCV(loc1));
				tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
				if ((EIF_BOOLEAN)(tc1 == (EIF_CHARACTER_8) '+')) {
					tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
					F741_5953(RTCV(loc1), tc1);
				} else {
					tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
					if ((EIF_BOOLEAN)(tc1 == (EIF_CHARACTER_8) '-')) {
						tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
						F741_5953(RTCV(loc1), tc1);
					} else {
						loc14 = (EIF_BOOLEAN) (EIF_BOOLEAN) 1;
					}
				}
				if ((EIF_BOOLEAN) !loc14) {
					loc12++;
					for (;;) {
						tb18 = '\01';
						if (!(EIF_BOOLEAN) (loc12 > loc13)) {
							tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
							tb19 = EIF_TEST(isspace(tc1));
							tb18 = (EIF_BOOLEAN) !tb19;
						}
						if (tb18) break;
						loc12++;
					}
					for (;;) {
						tb19 = '\01';
						if (!(EIF_BOOLEAN) (loc12 > loc13)) {
							tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
							tb20 = EIF_TEST(isdigit(tc1));
							tb19 = (EIF_BOOLEAN) !tb20;
						}
						if (tb19) break;
						tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
						tc1 = (EIF_CHARACTER_8) toupper(tc1);
						F741_5953(RTCV(loc1), tc1);
						loc12++;
					}
					loc11 = F733_5619(RTCV(loc1));
					loc11 = (EIF_INTEGER_32) (EIF_INTEGER_32) (loc11 * ((EIF_INTEGER_32) 60L));
					tb20 = '\0';
					if ((EIF_BOOLEAN) (loc12 <= loc13)) {
						tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
						tb20 = (EIF_BOOLEAN)(tc1 == (EIF_CHARACTER_8) ':');
					}
					if (tb20) {
						loc12++;
						F741_5966(RTCV(loc1));
						for (;;) {
							tb20 = '\01';
							if (!(EIF_BOOLEAN) (loc12 > loc13)) {
								tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
								tb21 = EIF_TEST(isdigit(tc1));
								tb20 = (EIF_BOOLEAN) !tb21;
							}
							if (tb20) break;
							tc1 = *(EIF_CHARACTER_8 *)(eif_optimize_return = 1, (FUNCTION_CAST(EIF_REFERENCE, (EIF_REFERENCE, EIF_INTEGER_32)) R3942[Dtype(arg1)-578])(RTCV(arg1), loc12));
							tc1 = (EIF_CHARACTER_8) toupper(tc1);
							F741_5953(RTCV(loc1), tc1);
							loc12++;
						}
						tr1 = RTLNS(833, 833, _OBJSIZ_0_0_0_1_0_0_0_0_);
						*(EIF_INTEGER_32 *)tr1 = loc11;
						
						ti4_1 = F832_6681(RTCV(tr1));
						ti4_2 = F733_5619(RTCV(loc1));
						loc11 += (EIF_INTEGER_32) (ti4_1 * ti4_2);
					}
				}
			}
		} else {
			loc14 = (EIF_BOOLEAN) (EIF_BOOLEAN) 1;
		}
	}
	if ((EIF_BOOLEAN) !loc14) {
		tr1 = RTLNS(937, 937, _OBJSIZ_2_0_0_2_0_0_0_1_);
		F938_8173(RTCV(tr1), loc5, loc10, loc4, loc6, loc7, loc8);
		Result = (EIF_REFERENCE) tr1;
		if ((EIF_BOOLEAN)(loc11 != ((EIF_INTEGER_32) 0L))) {
			F938_8203(RTCV(Result), (EIF_INTEGER_32) -loc11);
		}
	}
	RTLE;
	return Result;
}

void EIF_Minit323 (void)
{
	GTCX
}


#ifdef __cplusplus
}
#endif
